//? [내적]
//TODO <문제 설명>
//TODO 길이가 같은 두 1차원 정수 배열 a, b가 매개변수로 주어집니다.
//TODO a와 b의 내적을 return 하도록 solution 함수를 완성해주세요.
//TODO 이때, a와 b의 내적은 a[0]*b[0] + a[1]*b[1] + ... + a[n-1]*b[n-1] 입니다. (n은 a, b의 길이)

//! <제한 사항>
//! a, b의 길이는 1 이상 1,000 이하입니다.
//! a, b의 모든 수는 -1,000 이상 1,000 이하입니다.

//* <입출력 예>
//*   a=>     	    b=>             result=>         
//*   [1,2,3,4]	    [-3,-1,0,2]	    3
//*   [-1,0,1]	    [1,0,-1]	    -2

//::::

function solution(a, b) {
    return a.map((elem, idx) => elem * b[idx]).reduce((a, b) => a + b);
}
console.log(solution([1, 2, 3, 4], [-3, -1, 0, 2])) // 3
console.log(solution([-1, 0, 1], [1, 0, -1])) // -2

//-------------------------------------------------------------------------------------------